jonathangray/freebsd-1.x-ports/audio/netaudio/clients/audio/util/playbucket.man
.\" $NCDId: @(#)playbucket.man,v 1.1 1994/01/18 20:09:32 greg Exp $
.TH PLAYBUCKET 1 "" "NCDware 3.2"
.SH NAME
playbucket \- plays the bucket corresponding to the specified file
.SH SYNOPSIS
.B playbucket
[\-audio \fIservername\fP] [\-volume \fI0\-100\fP] \fIfilename\fP
.SH DESCRIPTION
The \fIplaybucket\fP program plays the bucket corresponding to the specified
file.  If no corresponding bucket exits, \fIplaybucket\fP will create one.
\fIplaybucket\fP sets its close down mode to \fBAuCloseDownRetainPermanent\fP
so the bucket is retained.
.SH OPTIONS
The following options may be used with \fIplaybucket\fP:
.IP "\fB\-audio\fP \fIservername\fP" 8
This option specifies the audio server to which \fIplaybucket\fP should
connect.
.IP "\fB\-volume\fP \fI0\-100\fP" 8
This option specifies the volume at which the data should be played as a 
percentage of the maximum possible volume.  The default is 100 percent.
.SH "SEE ALSO"
ncdaudio(1)
.SH COPYRIGHT
Copyright 1994 Network Computing Devices, Inc.
.SH AUTHOR
Greg Renda, Network Computing Devices, Inc.
