jonathangray/freebsd-1.x-ports/news/inn/doc/cvtbatch.8
.\" $Revision: 1.1 $
.TH CVTBATCH 8
.SH NAME
cvtbatch \- convert Usenet batch file to INN format
.SH SYNOPSIS
.I cvtbatch
[
.BI \-w " items"
]
.SH DESCRIPTION
.I Cvtbatch
reads standard input as a series of lines, converts each line, and
writes it to standard output.
It is used to convert simple batchfiles that contain just the article
name to INN batchfiles that contain additional information about each
article.
.PP
Each line is taken as the pathname to a Usenet article.
If it is not an absolute pathname, it is taken relative to the spool
directory,
.\" =()<.IR @<_PATH_SPOOL>@ .>()=
.IR /news/spool .
(Only the first word of each line is parsed; anything following
whitespace is ignored.)
.PP
The ``\-w'' flag specifies how each output line should be written.
The items for this flag should be chosen from the ``W'' flag items as
specified in
.IR newsfeeds (5).
They may be chosen from the following set:
.RS
.nf
	b	Size of article in bytes
	f	full pathname of article
	m	article message-id
	n	relative pathname of article
.fi
.RE
.PP
If the input file consists of a series of Message-ID's, then use
.IR grephistory (1)
with the ``\-s'' flag piped into
.IR cvtbatch .
.SH HISTORY
Written by Rich $alz <rsalz@uunet.uu.net> for InterNetNews.
.de R$
This is revision \\$3, dated \\$4.
..
.R$ $Id: cvtbatch.8,v 1.1 1993/08/27 02:46:04 alm Exp $
.SH "SEE ALSO"
grephistory(1)
newsfeeds(5).
