jonathangray/freebsd-1.x-ports/news/inn/doc/innxmit.8
.\" $Revision: 1.1 $
.TH INNXMIT 8
.SH NAME
innxmit \- send Usenet articles to a remote NNTP server
.SH SYNOPSIS
.I innxmit
[
.BI \-A " alt_spool"
]
[
.B \-a
]
[
.B \-d
]
[
.B \-M
]
[
.B \-r
]
[
.BI \-t " timeout"
]
[
.BI \-T " timeout"
]
[
.B \-p
]
[
.B \-S
]
.I host
.I file
.SH DESCRIPTION
.I Innxmit
connects to the NNTP server at the specified
.I host
and sends it the articles specified in the batchfile named
.IR file .
It is normally invoked by a script run out of
.IR cron (8)
that uses
.IR shlock (1)
to lock the host name, followed by a
.IR ctlinnd (8)
command to flush the batchfile.
.PP
.I Innxmit
normally blocks until the connection is made.
To specify a timeout on how long to try to make the connection, use the ``\-t''
flag.
To specify the total amount of time that should be allowed for article
transfers, use the ``\-T'' flag.
The default is to wait until an I/O error occurs, or all the articles have
been transferred.
If the ``\-T'' flag is used, the time is checked just before an article
is started; it will not abort a transfer that is in progress.
Both values are measured in seconds.
.PP
If the
.I file
is not an absolute pathname, it is taken relative to the
.\" =()<.I @<_PATH_BATCHDIR>@>()=
.I /news/spool/out.going
directory.
It is normally written by specifying the ``Wnm'' flags in the
.IR newsfeeds (5)
file.
Each line in the batchfile should be in one of the following formats:
.RS
.nf
filename Message-ID
filename
.fi
.RE
.PP
The
.I filename
field names the article to be sent.
If it is not an absolute pathname it is taken relative to the news
spool directory,
.\" =()<.IR @<_PATH_SPOOL>@ .>()=
.IR /news/spool .
If the
.I Message-ID
field is not specified, it will be obtained by scanning the article.
The
.I filename
and
.I Message-Id
fields are separated by a space.
.PP
If a communication error such as a
.IR write (2)
failure occurs,
.I innxmit
will stop sending and rewrite the batchfile to contain the current
article and any other unsent articles.
.PP
If the remote server sends an unexpected reply code,
.I innxmit
will requeue the article and proceed.
Use the ``\-r'' flag if the article should not be requeued.
.PP
Upon exit,
.I innxmit
reports transfer and CPU usage statistics via
.IR syslog (3).
If the ``\-v'' flag is used, they will also be printed on the standard
output.
If all articles were sent successfully,
.I innxmit
will remove the batchfile, otherwise it will rewrite it to contain the
list of unsent articles.
If no articles were sent or rejected, the file is left untouched.
This can cause the batchfile to grow excessively large if many articles
have been expired and there are communication problems.
To always rewrite the batchfile, use the ``\-a'' flag.
If the ``\-p'' flag is given, then no connection is made and the batchfile
is purged of entries that refer to files that no longer exist.
This implies the ``\-a'' flag.
.PP
If the ``\-S'' flag is given, then
.I innxmit
will offer articles to the specified host using the
.I "``xreplic''"
protocol extension described in
.IR innd (8).
To use this flag, the input file must contain the history data (commas
are transliterated to spaces by the server).
In order for this flag to be used, the input must contain the necessary
history entries.
This is usually done by setting up a ``WnR'' entry in the
.I newsfeeds
file.
.PP
Use the ``\-d'' flag to print debugging information on standard error.
This will show the protocol transactions between
.I innxmit
and the NNTP server on the remote host.
.PP
If the ``\-M'' flag is used then
.I innxmit
will scan an article's headers before sending it.
If the article appears to be a MIME article that is not in seven-bit
format, the article will be sent in ``quoted-printable'' form.
.PP
The ``\-A'' flag may be used to specify an alternate spool directory to
use if the article is not found; this would normally be an NFS-mounted
spool directory of a master server with longer expiration times.
.SH HISTORY
Written by Rich $alz <rsalz@uunet.uu.net> for InterNetNews.
.de R$
This is revision \\$3, dated \\$4.
..
.R$ $Id: innxmit.8,v 1.1 1993/08/27 02:46:05 alm Exp $
.SH "SEE ALSO"
ctlinnd(8),
innd(8),
newsfeeds(5),
shlock(1).
