jonathangray/freebsd-1.x-ports/comm/flexfax/man/dialrules.4f
.\"	$Header: /a/cvs/386BSD/ports/comm/flexfax/man/dialrules.4f,v 1.1 1993/08/31 23:45:40 ljo Exp $
.\"
.\" FlexFAX Facsimile Software
.\"
.\" Copyright (c) 1993 Sam Leffler
.\" Copyright (c) 1993 Silicon Graphics, Inc.
.\" 
.\" Permission to use, copy, modify, distribute, and sell this software and 
.\" its documentation for any purpose is hereby granted without fee, provided
.\" that (i) the above copyright notices and this permission notice appear in
.\" all copies of the software and related documentation, and (ii) the names of
.\" Sam Leffler and Silicon Graphics may not be used in any advertising or
.\" publicity relating to the software without the specific, prior written
.\" permission of Sam Leffler and Silicon Graphics.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS-IS" AND WITHOUT WARRANTY OF ANY KIND, 
.\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY 
.\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  
.\" 
.\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR
.\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,
.\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF 
.\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE 
.\" OF THIS SOFTWARE.
.\"
.TH DIALRULES 4F "May 12, 1993"
.SH NAME
dialrules \-
.I FlexFAX
dial string processing rules
.SH DESCRIPTION
A dial string specifies how to dial the telephone in order to
reach a destination facsimile machine.
This string is supplied by a user with each outgoing facsimile job.
User-supplied dial strings need to be processed in two ways by the
facsimile server process:
to craft a canonical phone number for use in locating the remote
machines capabilities,
and
to process into a form suitable for sending to a modem.
Phone number canonicalization and dial string preparation
are done according to 
.I "dial string processing rules"
that are located in a file specified in the server configuration
file; see the
.I DialStringRules
parameter in
.IR config (4F).
.PP
A dial string rules file is an
.SM ASCII
file containing one or more 
.IR "rule sets" .
A rule set defines a set of
.I "transformation rules"
that are sequentially applied to a dial string.
Each rule set is associated with an identifier, with certain well-known
identifiers being used by the facsimile server process.
Each transformation rule is a regular expression and a replacement string;
the regular expression is repeatedly applied to a dial string and any
matching substring is replaced by the replacement string.
.PP
The syntax of a dial string rules file is as follows.
Comments are introduced with the ``!'' character and continue to the
end of the current line.
Identifiers are formed from a leading alphabetic and any number of
subsequent alpha-numeric characters.
A rule set is of the form:
.sp .5
.nf
.in +.5i
\fIIdentifier\fP \fB:= [\fP
    \fIrule1\fP
    \fIrule2\fP
    ...
\fB]\fP
.in -.5i
.fi
.sp .5
where 
.IR rule1 ,
.IR rule2 ,
and so on are transformation rules.
Line breaks are significant.
The initial rule set definition line and the trailing ``]'' must be
on separate lines; and each transoformation rule must also be on a
single line.
Transformation rules are of the form:
.sp .5
.nf
.ti +.5i
\fIregular-expression\fP \fB=\fP \fIreplacement\fP
.fi
.sp .5
where
.I regular-expression
is a regular expression acceptable to
.IR regex (3X)
and
.I replacement
is a string that is substituted in place of any portion of the dial
string that is matched by the
.IR regular-expression .
White space is significant in parsing transformation rules.
If a regular expression or replacement string has embedded white space
in it, then the white space needs to be escaped with a ``\e'' character
or the entire string should be enclosed in quote (``"'') marks.
Replacement strings may reference the entire string matched by the
regular expression with the ``&'' character.
Substrings matched with the ``\e(...\e)'' constructs may be referenced
by using ``\e\fIn\fP'' where
.I n
is a single numeric digit between 1 and 9 that refers to the
.IR n -th
matched substring; c.f.
.IR regex (3X);
.IR sed (1),
etc.
.PP
To simplify and parameterize the construction of rule sets, dial string
rules files may also include simple text-oriented variable definitions.
A line of the form:
.sp .5
.nf
.ti +.5i
\fIfoo\fP\fB=\fP\fIstring\fP
.fi
.sp .5
defines a variable named
.I foo
that has the value
.IR string .
String values with embedded whitespace must use the ``\e'' character
or be enclosed in quote marks.
Variables are interpolated into transformation rules by referencing them
as:
.sp .5
.nf
.ti +.5i
\fB${\fP\fIvar\fP\fB}\fP
.fi
.sp .5
Note that variable interpolation is done only once, at the time a
transformation rule is defined.
This means that forward references are not supported and that
circular definitions will not cause loops.
The facsimile server automatically defines four variables to have
the values defined in its configuration file:
.IR AreaCode ,
.IR CountryCode ,
.IR LongDistancePrefix ,
and
.IR InterationalPrefix 
These variables are initialized before parsing a dial string rules
file; thus if they are defined in the rules file then they will
override any definition by the server.
.SH EXAMPLES
This is the default set of rules for transforming a dial string into
a canonical phone number:
.sp .5
.nf
.in +.5i
.ta \w'LDPrefix=${LongDistancePrefix}    'u
Area=${AreaCode}	! local area code
Country=${CountryCode}	! local country code
IDPrefix=${InternationalPrefix}	! prefix for placing an international call
LDPrefix=${LongDistancePrefix}	! prefix for placing a long distance call
!
! Convert a phone number to a canonical format:
!
!    +<country><areacode><rest>
!
! by (possibly) stripping off leading dialing prefixes for
! long distance and/or international dialing.
!
CanonicalNumber := [
.ta \w'^${LDPrefix}      'u +\w'= 'u +\w'+${Country}${Area}&      'u
#.*	=		! strip calling card stuff
[^+0-9]+	=		! strip white space etc.
^${IDPrefix}	= +		! replace int. dialing code
^${LDPrefix}	= +${Country}	! replace l.d. dialing code
^[^+]	= +${Country}${Area}&	! otherwise, insert canon form
]
.in -.5i
.fi
.sp .5
The rule set name,
.IR CanonicalNumber ,
is well-known to the facsimile server.
The first rule simply strips anything following a ``#''; this
will remove any calling card-related information.
The second rule removes everything but numbers and plus signs.
The third rule translates any explcit international dialing prefix
into the ``+'' symbol used to identify country codes.
The fourth rule replaces a leading long distance dialing prefix
with the local country code string.
The last rule matches local phone numbers and inserts the local
country code and area code.
.PP
As an example, assume that
.sp .5
.nf
.in +.5i
AreaCode=415
CountryCode=1
InternationalPrefix=011
LongDistancePrefix=1
.in -.5i
.fi
.sp .5
then if the above set of rules is applied
to ``01123965-7824#2345'', the transformations would be:
.sp .5
.nf
.ta \w'01123965-7824@2345    'u +\w'01123965-7824    'u
.in +.5i
01123965-7824@2345	01123965-7824	! strip calling card stuff
01123965-7824	011239657824		! strip white space etc.
011239657824	+239657824	! replace int. dialing code
+239657824	+239657824	! replace l.d. dialing code
+239657824	+239657824	! otherwise, insert canon form
.in -.5i
.fi
.sp .5
for a final result of ``+239657824''.
.SH "SEE ALSO"
.IR sendfax (1),
.IR faxd (1M),
.IR config (4F)
