jonathangray/freebsd-1.x-ports/comm/flexfax/man/faxquit.1m
.\"	$Header: /a/cvs/386BSD/ports/comm/flexfax/man/faxquit.1m,v 1.1 1993/08/31 23:45:48 ljo Exp $
.\"
.\" FlexFAX Facsimile Software
.\"
.\" Copyright (c) 1990, 1991, 1992, 1993 Sam Leffler
.\" Copyright (c) 1991, 1992, 1993 Silicon Graphics, Inc.
.\" 
.\" Permission to use, copy, modify, distribute, and sell this software and 
.\" its documentation for any purpose is hereby granted without fee, provided
.\" that (i) the above copyright notices and this permission notice appear in
.\" all copies of the software and related documentation, and (ii) the names of
.\" Sam Leffler and Silicon Graphics may not be used in any advertising or
.\" publicity relating to the software without the specific, prior written
.\" permission of Sam Leffler and Silicon Graphics.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS-IS" AND WITHOUT WARRANTY OF ANY KIND, 
.\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY 
.\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  
.\" 
.\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR
.\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,
.\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF 
.\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE 
.\" OF THIS SOFTWARE.
.\"
.TH FAXQUIT 1M "May 12, 1993"
.SH NAME
faxquit \- tell facsimile server to terminate
.SH SYNOPSIS
.B faxquit
[
.B \-q
.I queue-dir
] [
.I modem
]
.SH DESCRIPTION
.I Faxquit
sends a message to the facsimile server process servicing
.I modem
telling it to quit operation.
.PP
If
.I modem
is specified, it can either be the name (typically the
last component of the terminal port the
modem is attached to), or the full name
of the associated 
.SM FIFO
named pipe file, e.g. ``\s-1FIFO\s+1.ttym2''.
If no modem is specified,
.I faxquit
will send the request to the ``\s-1FIFO\s+1'' named pipe file;
this is convenient for machines that have only one facsimile
server running.
.SH OPTIONS
The
.B \-q
option can be used to specify a spooling area other than
.IR ${SPOOL} .
.SH FILES
Consult
.IR intro (4F)
for a complete discussion of the structure and
content of the spooling area.
.SH "SEE ALSO"
.IR intro (4F),
.IR faxd (1M)
