jonathangray/freebsd-1.x-ports/comm/flexfax/man/status.4f
.\"	$Header: /a/cvs/386BSD/ports/comm/flexfax/man/status.4f,v 1.1 1993/08/31 23:46:01 ljo Exp $
.\"
.\" FlexFAX Facsimile Software
.\"
.\" Copyright (c) 1990, 1991, 1992, 1993 Sam Leffler
.\" Copyright (c) 1991, 1992, 1993 Silicon Graphics, Inc.
.\" 
.\" Permission to use, copy, modify, distribute, and sell this software and 
.\" its documentation for any purpose is hereby granted without fee, provided
.\" that (i) the above copyright notices and this permission notice appear in
.\" all copies of the software and related documentation, and (ii) the names of
.\" Sam Leffler and Silicon Graphics may not be used in any advertising or
.\" publicity relating to the software without the specific, prior written
.\" permission of Sam Leffler and Silicon Graphics.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS-IS" AND WITHOUT WARRANTY OF ANY KIND, 
.\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY 
.\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  
.\" 
.\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR
.\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,
.\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF 
.\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE 
.\" OF THIS SOFTWARE.
.\"
.TH STATUS 4F "October 22, 1992"
.SH NAME
status \- server status database
.SH DESCRIPTION
Files in the
.B etc/status
directory in the
.I FlexFAX
spooling area contain status information about each running server.
Files are named according to the modem being serviced.
The contents of each file is an 
.SM ASCII
string that indicates what the server is currently doing:
``Running and idle'', ``Sending to ...'', ``Answering the phone'', etc.
.IR faxd.recv (1M)
passes the status information in these files to the
.IR faxstat (1)
program.
.SH "SEE ALSO"
.IR faxd (1M),
.IR faxd.recv (1M),
.IR faxstat (1)
