jonathangray/freebsd-1.x-ports/comm/flexfax/man/tsi.4f
.\"	$Header: /a/cvs/386BSD/ports/comm/flexfax/man/tsi.4f,v 1.1 1993/08/31 23:46:03 ljo Exp $
.\"
.\" FlexFAX Facsimile Software
.\"
.\" Copyright (c) 1990, 1991, 1992, 1993 Sam Leffler
.\" Copyright (c) 1991, 1992, 1993 Silicon Graphics, Inc.
.\" 
.\" Permission to use, copy, modify, distribute, and sell this software and 
.\" its documentation for any purpose is hereby granted without fee, provided
.\" that (i) the above copyright notices and this permission notice appear in
.\" all copies of the software and related documentation, and (ii) the names of
.\" Sam Leffler and Silicon Graphics may not be used in any advertising or
.\" publicity relating to the software without the specific, prior written
.\" permission of Sam Leffler and Silicon Graphics.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS-IS" AND WITHOUT WARRANTY OF ANY KIND, 
.\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY 
.\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  
.\" 
.\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR
.\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,
.\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF 
.\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE 
.\" OF THIS SOFTWARE.
.\"
.TH TSI 4F "January 15, 1993"
.SH NAME
tsi \- Transmission Subscriber Identification (\c
.SM TSI\c
) database
.SH DESCRIPTION
The file
.B etc/tsi
in the
.I FlexFAX
spooling area contains a collection of patterns.
If the
.B QualifyTSI
parameter is set in a modem configuration file,
the patterns in the file define the set of facsimile machines
that the fax server will accept incoming facsimile from.
.PP
Patterns are specified one per line and must conform to the
regular expressions syntax supported by
.IR regcmp (3X).
Comments may be included; they are introduced with the ``#''
character and extend to the end of the line.
Any trailing white space in a pattern is ignored (for convenience
when comments are used).
.PP
Note that regular expression patterns should be written to
match a
.SM TSI
exactly.
That is, patterns should be of the form:
.sp .5
.ti +0.5i
\fC^<pattern>$\fP
.PP
where the ``^'' and ``$'' characters are used to
specify the start and end of the matching
.SM TSI.
Additionally, regular expression patterns should handle
white space that may appear in known locations.  For example,
.sp .5
.ti +0.5i
\fC^([+]1){1}[ .-]*415[ .-]*555[ .-]*1212.*$\fP
.PP
matches the following
.SM TSI
strings:
.sp .5
.nf
.in +0.5i
\fC+1.415.555.1212\fP
\fC    415  555  1212\fP
\fC1-415-555-1212\fP
.in -0.5i
.fi
.PP
Finally, note that regular expressions can be used to specify
many
.SM TSI
with one pattern.
.SH NOTES
It would be nice if
.SM TSI
that were to be matched against were placed in some
canonical form (e.g. remove white space and white space-like
characters).
This is, however, problematic, because some facsimile
machines permit any printable
.SM ASCII
string to be sent as a
.SM TSI.
.SH "SEE ALSO"
.IR faxd (1M),
.IR regcmp (3X),
.IR config (4F)
