jonathangray/freebsd-1.x-ports/comm/flexfax/man/xferlog.4f
.\"	$Header: /a/cvs/386BSD/ports/comm/flexfax/man/xferlog.4f,v 1.1 1993/08/31 23:46:05 ljo Exp $
.\"
.\" FlexFAX Facsimile Software
.\"
.\" Copyright (c) 1990, 1991, 1992, 1993 Sam Leffler
.\" Copyright (c) 1991, 1992, 1993 Silicon Graphics, Inc.
.\" 
.\" Permission to use, copy, modify, distribute, and sell this software and 
.\" its documentation for any purpose is hereby granted without fee, provided
.\" that (i) the above copyright notices and this permission notice appear in
.\" all copies of the software and related documentation, and (ii) the names of
.\" Sam Leffler and Silicon Graphics may not be used in any advertising or
.\" publicity relating to the software without the specific, prior written
.\" permission of Sam Leffler and Silicon Graphics.
.\" 
.\" THE SOFTWARE IS PROVIDED "AS-IS" AND WITHOUT WARRANTY OF ANY KIND, 
.\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY 
.\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  
.\" 
.\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR
.\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,
.\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF 
.\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE 
.\" OF THIS SOFTWARE.
.\"
.TH XFERLOG 4F "July 27, 1993"
.SH NAME
xferlog \- 
.I FlexFAX
facsimile transfer log
.SH DESCRIPTION
The file
.B etc/xferlog
contains information about the transmission and reception
of facsimile for all facsimile modems on a machine.
The file contains one line per transfer.
Lines are fixed-format, tab-separated
.SM ASCII
strings.
Each record of a transmission is of the form:
.sp .5
.ti +0.5i
date \s-1SEND\s+1 modem sender dest-number \s-1CSI\s+1 sigrate format #pages time "reason"
.PP
while a reception record is of the form:
.sp .5
.ti +0.5i
date \s-1RECV\s+1 modem fax \s-1TSI\s+1 local-number sigrate format #pages time "reason"
.sp .5
where the fields are interpreted as:
.TP 14
.B date
The date and time of the transaction in the format
.SM "MM/DD/YY HH:MM",
where 
.SM MM
is the numeric month,
.SM DD
the numeric day,
.SM YY
the last two digits of the year, and
.SM HH:MM
is the time in 24-hour format.
.TP 14
.B sender
The sender/receiver's electronic mailing address
(receptions are always attributed to the ``fax'' user).
.TP 14
.B dest-number
The phone number dialed for outgoing calls.
.TP 14
.B \s-1TSI\s+1
The Transmitter Subscriber Identification string (as received) for
incoming calls.
.TP 14
.B \s-1CSI\s+1
The Caller Subscriber Identification string of the remote machine
(as reported) for outgoing calls.
.TP 14
.B local-number
The local phone number on which the data was received.
.TP 14
.B sigrate
The negotiatated signalling rate used for transferring data.
.TP 14
.B format
The negotiated data format used for transferring data.
.TP 14
.B #pages
The total number of pages transferred.
.TP 14
.B time
The duration of the session in the format
.SM HH:MM:SS.
.TP 14
.B reason
A string that indicates if any problem occured during the session.
.PP
Note that fields may have embedded blanks.
The signalling rate is given in bits per second.
The format is one of: ``1-D MR'', ``2-D MR'', ``2-D Uncompressed Mode''
(2-D MR with optional uncompressed data), and, ``2-D MMR''.
The page counts are always integral numbers.
Partial pages that are to be retransmitted are not included
in the page count.
.PP
The simple 
.SM ASCII
format was designed to be easy to process with programs like
.IR nawk (1).
.SH BUGS
The date format will ``break'' in the year 2000.
.SH "SEE ALSO"
.IR faxd (1M)
