jonathangray/freebsd-1.x-ports/audio/netaudio/clients/audio/aupanel/aupanel.man
.\" $NCDId: @(#)aupanel.man,v 1.4 1994/02/04 14:25:42 jan Exp $
.TH AUPANEL 1 "" "NCDware 3.2"
.SH NAME
aupanel \- allows user adjustment of NCDaudio device attributes
.IX aupanel#(1) "" "\fLaupanel\fP(1)"
.SH SYNOPSIS
\fBaupanel\fP [\fB\-audio\fP \fIservername\fP]
.SH DESCRIPTION
\fIaupanel\fP provides an X-based window-oriented interface allowing the user
to adjust the attributes of the devices provided by the NCDaudio service.
.SH AUPANEL AND THE ATHENA WIDGET SET
\fIaupanel\fP uses the X Toolkit Intrinsics and the Athena Widget Set.
For more information, see the Athena Widget Set documentation.
.SH ADJUSTING DEVICE ATTRIBUTES
To adjust the attributes of a device, select the desired device from the
\fBDevices\fP menu.  The device gain may be adjusted using the \fBGain\bP
slider.  If applicable, the device input mode can be toggled between
\fILine\fP and \fIMicrophone\fP by clicking on the \fBInput mode\fP box.
.PP
To query the current device attributes, click on the \fBQuery\fP button.
.SH ENVIRONMENT
In addition to the standard toolkit environment variables, the
following environment variables are used by \fIaupanel\fP:
.IP \fBAUDIOSERVER\fP 8
This variable specifies the default audio server to contact if \fI\-audio\fP
is not specified on the command line.  If this variable is not set and
the \fI\-audio\fP is not specified on the command line, \fIaupanel\fP
will attempt to connect to the audio server running on the
X Window System display.
.SH "SEE ALSO"
ncdaudio(1), auctl(1), X(1)
.SH COPYRIGHT
Copyright 1993, 1994 Network Computing Devices, Inc.
.SH AUTHOR
Greg Renda, Network Computing Devices, Inc.
