jonathangray/freebsd-1.x-ports/print/tex/TeX3.14/man/OLD/mf.1
.TH MF 1  3/4/90
.SH NAME
cmmf, inimf, virmf  \- METAFONT, a language for font design
.SH SYNOPSIS
.B cmmf 
[ first line ]
.PP
.B inimf
[ first line ]
.PP
.B virmf
[ first line ]
.ie t .ds TX \fRT\v'+0.3m'E\v'-0.3m'X\fP \" for troff
.el .ds TX TeX \" for nroff
.\" to use, type \*(TX
.ie t .ds OX \fIT\v'+0.3m'E\v'-0.3m'X\fP \" for troff
.el .ds OX TeX \" for nroff
.\" the same but obliqued

.SH DESCRIPTION
M\s-2ETAFONT\s0
reads the program in the specified files
and outputs font rasters (in gf format) and font metrics (tfm files).
M\s-2ETAFONT\s0
capabilities and language are described in
.I The M\s-2ETAFONT\s0\^book
by Donald E. Knuth, published by Addison-Wesley.  There is also an older
manual,
.I \*(OX and M\s-2ETAFONT\s0,
which describes the older version of M\s-2ETAFONT\s0, now called M\s-2ETAFONT\s0-in-SAIL,
but this description is now obsolete.
.PP
Like
\*(TX, M\s-2ETAFONT\s0
is normally used with a large body of precompiled macros, and font generation
in particular requires the support of several macro files.  The basic
programs as compiled are called
.I inimf
and
.I virmf, 
and are distinguished by the fact that 
.I inimf 
can be used to precompile macros into a ``*.base'' file,
which is used by
.I virmf. Virmf
can read a precompiled ``*.base'' file, but it cannot create one.  It is
the version of
M\s-2ETAFONT\s0
which lies behind most font production systems.
.PP
By convention, the program used to compile the Computer Modern fonts is
called 
.I cmmf,
which is essentially an alias for 
.I virmf 
with the Computer Modern support macros loaded in as a ``base'' file.
In the following discussion, the name
M\s-2ETAFONT\s0 
will be used whenever the behavior of all varieties of the program
is the same.  Otherwise, it should be assumed that the behavior
described is unique to the program named.
Any arguments given on the command line to one of the
M\s-2ETAFONT\s0
programs, such as 
.I cmmf,
are passed to them as the first input line.
As described in 
.I The M\s-2ETAFONT\s0\^book,
that line should begin with a file name
or a \\\|controlsequence.
The normal usage is to say
.IP
\fBcmmf\ \fR ' \\\|mode=<printengine>\^;\^ [\^\\\|mag=magstep(\fI\^n\fR\^)\^;\^] ' input\ \^\fI font \fR
.PP
to start processing 
.I font.mf.  
The single quotes are the best way of keeping the
shell from misinterpreting the semicolons and 
from removing the \\ characters, which are needed here to
keep M\s-2ETAFONT\s0 from thinking that you want to produce a font called
``mode'' or ``mag''. Other
\\\|controlsequences, such as \\\|batchmode (for silent operation) can
also appear. 
The name ``font'' will be the ``jobname'', and is used in forming
output file names.
If M\s-2ETAFONT\s0 doesn't get a file name in the first line, 
the jobname is ``mfput''.
The default `.mf' extension can be overridden by specifying an extension
explicitly.
There is no way to read a M\s-2ETAFONT\s0 input file with no filename extension.
.PP
A log of error messages goes 
into \fI font\fB\^.\^\fIlog\fR where\fI font\fR is the jobname.  
The output files 
are \fI font\fB\^.\^\fItfm\fR and \fI font\fB\^.\^\fI<\fR\^number\^\fI>gf\fR
where <number> depends on the resolution and
magnification of the font.  The ``\\\|mode'' in this example is 
shown generically as <printengine>, a symbolic term for which the name
of an actual printengine or the name ``localfont'' (see below) must be
substituted.
If the ``\\\|mode'' is not specified
or is not valid for your site, 
M\s-2ETAFONT\s0 
will
default to ``proof'' mode which produces large character images for
use in font design and refinement.  Proof mode can immediately
be recognized by the appearance of the suffix 
.I .2602gf 
\^ after the jobname.  Examples of proof mode output can be found
in 
.I The Computer Modern Fonts,
(Volume E of
.I Computers and Typesetting
), by Donald Knuth.
The system of 
.I magsteps 
is identical to the system used by
\*(TX,
with values normally in the range 0.5, 1.0, 2.0, 3.0, 4.0 and 5.0.
A listing of gf numbers for 118-dpi, 240-dpi and 300-dpi fonts
is shown below.
.ds f. mf.tbl \" tbl output inserted here
.TS 
.if \n+(b.=1 .nr d. \n(.c-\n(c.-1
.de 35
.ps \n(.s
.vs \n(.vu
.in \n(.iu
.if \n(.u .fi
.if \n(.j .ad
.if \n(.j=0 .na
..
.nf
.nr #~ 0
.if n .nr #~ 0.6n
.ds #d .d
.if \(ts\n(.z\(ts\(ts .ds #d nl
.fc
.nr 33 \n(.s
.rm 80 81 82 83
.nr 80 0
.nr 38 \w\s-2MAGSTEP\s0
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(0)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(0.5)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(1)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(2)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(3)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(4)
.if \n(80<\n(38 .nr 80 \n(38
.nr 38 \wmag=magstep(5)
.if \n(80<\n(38 .nr 80 \n(38
.80
.rm 80
.nr 81 0
.nr 38 \w118 dpi
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w118
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w129
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w142
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w170
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w204
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w245
.if \n(81<\n(38 .nr 81 \n(38
.nr 38 \w294
.if \n(81<\n(38 .nr 81 \n(38
.81
.rm 81
.nr 82 0
.nr 38 \w240 dpi
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w240
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w263
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w288
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w346
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w415
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w498
.if \n(82<\n(38 .nr 82 \n(38
.nr 38 \w597
.if \n(82<\n(38 .nr 82 \n(38
.82
.rm 82
.nr 83 0
.nr 38 \w300 dpi
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w300
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w329
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w360
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w432
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w518
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w622
.if \n(83<\n(38 .nr 83 \n(38
.nr 38 \w746
.if \n(83<\n(38 .nr 83 \n(38
.83
.rm 83
.nr 38 1n
.nr 79 0
.nr 40 \n(79+(0*\n(38)
.nr 80 +\n(40
.nr 41 \n(80+(3*\n(38)
.nr 81 +\n(41
.nr 42 \n(81+(3*\n(38)
.nr 82 +\n(42
.nr 43 \n(82+(3*\n(38)
.nr 83 +\n(43
.nr TW \n(83
.if t .if \n(TW>\n(.li .tm Table at line 13 file mf.tbl is too wide - \n(TW units
.nr #I \n(.i
.in +(\n(.lu-\n(TWu-\n(.iu)/2u
.fc  
.nr #T 0-1
.nr #a 0-1
.eo
.de T#
.ds #d .d
.if \(ts\n(.z\(ts\(ts .ds #d nl
.mk ##
.nr ## -1v
.ls 1
.ls
..
.ec
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'\s-2MAGSTEP\s0\h'|\n(41u'118 dpi\h'|\n(42u'240 dpi\h'|\n(43u'300 dpi
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(0)\h'|\n(41u'118\h'|\n(42u'240\h'|\n(43u'300
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(0.5)\h'|\n(41u'129\h'|\n(42u'263\h'|\n(43u'329
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(1)\h'|\n(41u'142\h'|\n(42u'288\h'|\n(43u'360
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(2)\h'|\n(41u'170\h'|\n(42u'346\h'|\n(43u'432
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(3)\h'|\n(41u'204\h'|\n(42u'415\h'|\n(43u'518
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(4)\h'|\n(41u'245\h'|\n(42u'498\h'|\n(43u'622
.ta \n(80u \n(81u \n(82u \n(83u 
.nr 31 \n(.f
.nr 35 1m
\&\h'|\n(40u'mag=magstep(5)\h'|\n(41u'294\h'|\n(42u'597\h'|\n(43u'746
.fc
.nr T. 1
.T# 1
.in \n(#Iu
.35
.TE
.if \n-(b.=0 .nr c. \n(.c-\n(d.-12

.br
Magnification can also be specified not as a magstep but as an
arbitrary value, such as 1.315, to create special character sizes.
.PP

Before font production can begin, it is necessary to set up the
appropriate `base' files.  The minimum set of components for font
production for a given print-engine is the `plain.mf' macro file
and the local `mode_def' file.  The macros in `plain.mf' can be
studied in an appendix to the
.I M\s-2ETAFONT\s0\^book;
they were developed by Donald Knuth, and this file should never be
altered except when it is officially upgraded.  
Mode_def specifications are tailored to each different print-engine.
There is a regular discussion of them in the journal of the 
\*(TX
Users Group,
.I TUGboat,
and models can be found in the files `waits.mf' and `U_Wash.mf' which
come in the standard distribution of 
\*(TX
for Unix systems.  A good `mode_def' file (which we will here 
call `<\^\s-2SITE\s0\^>\^-modes.mf\|'\|) should also supply other
features in the `gf' and `tfm' output from 
.I cmmf.
With only `plain.mf' and `<\^\s-2SITE\s0\^>\^-modes.mf' 
loaded it is possible to
create fonts of simple characters, such as those used for the
M\s-2ETAFONT\s0
logo, and those used for the LaTeX line and circle fonts,
but the production of Computer Modern fonts requires that
`cmbase.mf', be loaded as well.
The best way to do this is to create a small ``driver'' file with
the lines
.br
.in +15
input plain
.br
input <\^\s-2SITE\s0\^>\^-modes
.br
input cmbase
.in -15
and name this file `cmmf.mf'.
Then run 
.I inimf
with the arguments ``cmmf dump'', and you will
finish up with a file named cmmf.base.
The `base' file is used by
.I virmf.
It needs to be given a base file name as the first thing it reads.
A base file name is preceded by an &, which needs to be quoted or
escaped with \\
if given on the command line.
.PP 
Fortunately, it is no longer necessary to make explicit references
to the base file.  The present version of M\s-2ETAFONT\s0, when compiled
from this distribution, looks at its own command line to determine
what name it was called under.  It then uses that name, with the
``.\|base'' suffix appended, to search for the appropriate base file.
This is the reason for naming the ``driver'' file above
.B cmmf\|.\|mf.
You should probably also make up another base file using a driver named
.B mf\|.\|mf,
with only the 
.B plain\|.\|mf 
and `mode_def' file declared.  This will be your base file when
you invoke \fIvirmf\fP with the name \fImf\fP.
To make the whole thing work, it is necessary to link \fIvirmf\fP to all
the names of base files that you have prepared.  Hard links will do
very nicely in this instance.
.PP
If you choose to preload ``cmmf''
using the ``undump'' program you get a faster startup, but
only at the price of lost flexibility and of large storage requirements
for the preloaded version.  
.B W\s-2ARNING\s0.  
Do not use a base with
.B cmbase\|.\|mf 
preloaded when you make up the line and circle fonts for
LaTeX.  It causes subtle errors in the compiled font and makes the
production of clean drawings in LaTeX picture mode virtually impossible.
.PP
There are some environment variables that can be used to set up directory
paths to search when M\s-2ETAFONT\s0 opens a file for input.
For example, the
.I csh
command
.br
.in +4
setenv \s-2MFINPUTS\s0\ .\^:\^/usr/me/mylib\^:\^/usr/local/lib/mf/inputs
.in -4
or the
.I sh
command sequence
.br
.in +4
\s-2MFINPUTS\s0\|=\|.\^:\^/usr/me/mylib\^:\^/usr/local/lib/mf/inputs
.br
export \s-2MFINPUTS\s0
.in -4
.br
would cause all invocations of M\s-2ETAFONT\s0 and its derivatives to look for
\\\|input files first in the current directory, then in a hypothetical
user's ``mylib'', and finally in the system library.
Normally, the user will place the command sequence which sets up the
\s-2MFINPUTS\s0 environment variable in the
.I .\|cshrc
or
.I .\|profile
file.
.PP
The
.I e
response to M\s-2ETAFONT\s0\|'s error-recovery mode invokes the
.I GNU emacs
editor at the erroneous line of the source file.
There is an environment variable, \s-2MFEDITOR\s0, 
that can be used to specify the editor.  
It should contain a string with "%s" indicating where the
filename goes and "%d" indicating where the decimal linenumber (if any) goes.
For example, an \s-2MFEDITOR\s0 string for the "vi" editor can be set by:
.br

.ti +3
     setenv \s-2MFEDITOR\s0 "/usr/ucb/vi +%d %s"
.br
.sp .7
(replacing the path name for the editor
as appropriate on your system).
The Environment section below lists the relevant environment variables,
and their defaults.
.PP
A convenient file in the library is null.mf, containing nothing.
When mf can't find the file it thinks you want to input, it keeps
asking you for another file name;  responding `null' gets you out
of the loop if you don't want to input anything.
.PP
.SH "EXAMPLES"
.PP
Most sites need at least two families of font resolution: 
one for printing and the other for previewing. If both write-white
and write-black printers are used at the same site it may even be
necessary to have two sets of fonts at the same resolution.
When preloaded with a `mode-def' file such as U_Wash.mf, M\s-2ETAFONT\s0
has several modes, each associated with a given print engine
or display device.  In regular use the mode `localfont' is made
equivalent to the mode for the print-engine most in use.  There are
also two styles of proof mode for character designers.
.TP 2.1i
.I	 proof mode 
Generates full-page font proofs using gray-pixel fonts
.TP
.I	 smoke mode
Generates full-page font proofs using black-pixel fonts
.TP
.I	 localfont mode
Generates font at resolution suitable for printing
.PP
Once a M\s-2ETAFONT\s0 source is written, the following steps
may be used to generate a GF file for proofing, TFM 
file for the width table, and raster font files for printing and previewing
at each desired resolution.
.br
.TP 2i
	STEP 1. Compile font
.br
Input: cmmf myfont 
.br
Output: myfont.2602gf, myfont.log
.TP
	STEP 2. Generate DVI-file
.br
Input: gftodvi myfont.2602gf
.br
Output: myfont.dvi, myfont.log
.TP
	STEP 3. Produce printable output (e. g. from a PostScript printer)
.br
Input: dvitps myfont | lpr 
.br
Note: You need special black, gray and slant fonts for this.
.TP
	STEP 4. Generate generic format rastered font:
.br
Input: cmmf\ ' \\\|mode=localfont\^;\^ \\\|mag=magstep(1.0)\^; ' input myfont
.br
Output: myfont.360gf, myfont.tfm, myfont.log
.br
Steps 1 through 3 are necessarily only if you are working on a new design.
If all you need is a specific size and resolution of a well-known font,
then only step 4 is needed.  
.SH ENVIRONMENT
The defaults for all environments are set at the
time of compilation, by reference to a file called site.h.  
The values given below are preset in this file, and may be
different at some sites.
.PP
.IP \s-2MFINPUTS\s0
Search path for \\\|input and \\\|openin files.  It should be colon-separated,
and start with ``.''.  The entire path must be no longer than 700
characters long.  
Default: .\^:\^/usr/local/lib/mf/inputs
.IP \s-2MFBASES\s0
Search path for base files.  Default: .\^:\^/usr/local/lib/mf/bases
.IP \s-2MFPOOL\s0
Search path for M\s-2ETAFONT\s0 strings.  Default: .\^:\^/usr/local/lib/mf
.IP \s-2MFEDITOR\s0
Command template for switching to editor.  Default: /usr/local/bin/emacs +%d %s
.br

.SH "FONT UTILITIES"
.PP
A number of utility programs are available (see section See Also). 
The following is a partial list of available utilities and their purpose. 
Consult your local M\s-2ETAFONT\s0 guru for details.
.br
.TP 1.5i
.B	 gftopk
Takes a GF file and produces a more tightly packed PK font file 
.TP
.B	 pktogf
Unpacks a PK file into GF format
.TP
.B	 gftodvi
Produces proof sheets for fonts
.TP
.B	 gftype
Displays the contents of a GF file in mnemonics and images
.br
.TP
.B	 pktype
Mnemonically displays the contents of a PK file
.br
.TP
.B	 mft
Formats a source file (font.mf) as shown in
.I Computer Modern Typefaces
.PP

.SH "FILES"
.TP 1.3i
/usr/local/lib/mf
M\s-2ETAFONT\s0's library area
.TP
/usr/local/lib/mf/mf.pool
Encoded text of M\s-2ETAFONT\s0's messages
.TP
/usr/local/lib/mf/bases
M\s-2ETAFONT\s0 *.base files and short driver files for inimf
.TP
/usr/local/lib/mf/inputs/plain.mf
The ``standard'' macro package
.TP
/usr/local/lib/mf/inputs/`\s-2SITE\s0\^-modes'.mf
The file of ``mode_def''s for your site's various printers
.TP
/usr/local/lib/mf/inputs/cmbase.mf
M\s-2ETAFONT\s0 macros for Computer Modern
.br

.SH "SUGGESTED READING"
Donald E. Knuth,
.I The M\s-2ETAFONT\s0\^book
(Volume C of \fI Computers and Typesetting\fR\|)
.br
Donald E. Knuth,
.I M\s-2ETAFONT\s0\^ the Program
(Volume D of \fI Computers and Typesetting\fR\|)
.br
Donald E. Knuth,
.I Computer Modern Typefaces 
(Volume E of \fI Computers and Typesetting\fR\|)
.br
.I TUGboat
(the publication of the \*(TX Users Group)
.br
.SH "COMMENTS"
Warning: ``Type design can be hazardous to your other interests. 
Once you get hooked, you will develop intense feelings about letterforms;
the medium will intrude on the messages that you read.
And you will perpetually be thinking of improvements to the fonts that
you see everywhere, especially those of your own design.''
.br
.SH "BUGS"
On January 4, 1986 the ``final''
bug in M\s-2ETAFONT\s0 was discovered and removed. If an error still
lurks in the code, D. E. Knuth promises to
pay a finders fee which doubles every year
to the first person who finds it. Happy
hunting.
.PP
The ``no format preloaded'' message could be considered an undesirable
fossil, but it is not a bug.
.br
.SH "AUTHORS"
M\s-2ETAFONT\s0 was designed by Donald E. Knuth, 
who implemented it using his W\s-2EB\s0 system for Pascal programs.
It was ported to Unix by Paul Richards at the University of Illinois
at Urbana-Champlain.
The version now offered with the Unix \*(TX distribution is that 
generated by the W\s-2EB\s0 to C system, 
written by Tomas Rokicki and Tim Morgan.
This page written by Pierre MacKay, with help from the anonymous
author of the page in the jTeX software distribution.
.br
.SH "SEE ALSO"
dvitype(1), gftopk(1), gftodvi(1), gftype(1), pktogf(1), mft(1),
pktype(1), pltotf(1), tftopl(1), undump(1)

