jonathangray/freebsd-1.x-ports/print/texk/web2c-6.1/web2c/man/amstex.man
.TH AMSTEX 1 "27 December 1992"
.\"=====================================================================
.if t .ds TX \fRT\\h'-0.1667m'\\v'0.20v'E\\v'-0.20v'\\h'-0.125m'X\fP
.if n .ds TX TeX
.ie t .ds OX \fIT\v'+0.25m'E\v'-0.25m'X\fP\" for troff
.el .ds OX TeX\" for nroff
.\" the same but obliqued
.\" BX definition must follow TX so BX can use TX
.if t .ds BX \fRB\s-2IB\s0\fP\*(TX
.if n .ds BX BibTeX
.\" LX definition must follow TX so LX can use TX
.if t .ds LX \fRL\\h'-0.36m'\\v'-0.15v'\s-2A\s0\\h'-0.15m'\\v'0.15v'\fP\*(TX
.if n .ds LX LaTeX
.if t .ds AX \fRA\\h'-0.1667m'\\v'0.20v'M\\v'-0.20v'\\h'-0.125m'S\fP\*(TX
.if n .ds AX AmSTeX
.if t .ds AY \fRA\\h'-0.1667m'\\v'0.20v'M\\v'-0.20v'\\h'-0.125m'S\fP\*(LX
.if n .ds AY AmSLaTeX
.\"=====================================================================
.SH NAME
amstex \- structured text formatting and typesetting
.SH SYNOPSIS
.B amstex
[ first line ]
.\"=====================================================================
.SH DESCRIPTION
The \*(AX language is described in the book
.IR "The Joy of \*(OX" .
\*(AX is a \*(TX macro package, not a modification to the \*(TX source
program, so all the capabilities described in
.BR tex (1)
are present.
.PP
The \*(AX macros encourage writers to think about the content of their
documents, rather than the form.  The ideal, not always realized, is to
have no formatting commands (like ``switch to italic'' or ``skip 2
picas'') in the document at all; instead, everything is done
by specific markup instructions: ``emphasize'', ``start a section''.
.PP
\*(AX is the official typesetting system of the American Mathematical
Society, and nearly all of its publications are typeset using \*(AX.  The
online version of AMS Math Reviews uses \*(AX input syntax for display of
mathematical material.  AMS authors can provide editors with
computer-readable \*(AX files.
.PP
For authors more familiar with \*(LX, an AMS-supported variant called
\*(AY is available.
.\"=====================================================================
.SH "SEE ALSO"
.BR amslatex (1),
.BR latex (1),
.BR tex (1),
.BR slitex (1).
.br
Michael Spivak,
.IR "The Joy of \*(OX" ,
2nd edition, Addison-Wesley, 1990, ISBN 0-8218-2997-1.
