jonathangray/freebsd-1.x-ports/game/xmine/xmine.man
.TH XMINE 1
.SH NAME
xmine \- identify mines in a mine field without getting blown up
.SH SYNOPSIS
.RB xmine
.SH DESCRIPTION
.I xmine
is an X11-based version of the popular PC game Minesweeper. The
object is to place flags on mines on the game board without exposing
them.  If you expose a mine, it "explodes" and the game ends.  Exposed
mines appear as black capital "M" characters.
.PP
To begin, click the first mouse button anywhere on the field.
A series of numbers will be revealed.  The number
in each square corresponds to the number of mines that border
that square, including diagonals.  Squares that do not border
mines are empty.
.PP
Once you have determined the location of a mine, flag it by
clicking with the third mouse button.  Flags appear as
capital "X" characters which are red on color displays.
Once you have marked
all the mines surrounding a number, click the middle mouse
button to reveal the contents of the un-mined squares surrounding
it.  If you flag a mine incorrectly and force an unflagged mine
to be revealed, the game ends.
.PP
The number at the top left of the game board displays the number
of mines left for you to identify.  At the top right is a timer
that indicates the number of seconds for which the game has
been running.  High scores are achieved by having the fastest
time for a skill level.
.PP
There are four levels of game play: beginner, intermediate,
expert, and custom, set using the Game menu.  For each level, the number of
mines and the size of the board increase:
.TP 5
.B beginner
has 10 mines in an 8x8 board.
.TP 5
.B intermediate
has 40 mines in a 16x16 board.
.TP 5
.B expert
has 99 mines in a 16x39 board.
.TP 5
.B custom
allows you to specify your own board dimensions and number of mines.
.PP
If you choose Marks [?] from the Game menu, you may place question
marks on squares by clicking twice with the third mouse button.
Although they may be helpful for deducing the location of mines,
they are not treated as flagged mines when you click with the middle
mouse button on a numbered square.
.SH AUTHOR
Paul Falstad
.br
Manual entry written by Linda Branagan.
